{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v2.8.5", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "8"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_wrapper/flatten_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_wrapper/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_wrapper/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_wrapper/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/model_wrapper/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_wrapper/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_wrapper/dense_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, {"name": "StatefulPartitionedCall/model_wrapper/flatten_2/Reshape", "op": "Reshape", "input": ["input_1", "StatefulPartitionedCall/model_wrapper/flatten_2/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_wrapper/dense_6/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_wrapper/flatten_2/Reshape", "StatefulPartitionedCall/model_wrapper/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_wrapper/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/model_wrapper/dense_7/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_wrapper/dense_6/Relu", "StatefulPartitionedCall/model_wrapper/dense_7/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_wrapper/dense_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_wrapper/dense_8/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_wrapper/dense_7/Relu", "StatefulPartitionedCall/model_wrapper/dense_8/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_wrapper/dense_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_wrapper/dense_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_wrapper/flatten_2/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_wrapper/dense_6/MatMul/ReadVariableOp", "shape": [5, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_wrapper/dense_6/BiasAdd/ReadVariableOp", "shape": [100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_wrapper/dense_7/MatMul/ReadVariableOp", "shape": [100, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_wrapper/dense_7/BiasAdd/ReadVariableOp", "shape": [100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_wrapper/dense_8/MatMul/ReadVariableOp", "shape": [100, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_wrapper/dense_8/BiasAdd/ReadVariableOp", "shape": [8], "dtype": "float32"}]}]}